import { css } from "@emotion/react";

const headerStyle = css`
  font-family: "KoPubWorldDotumBold";
`;

const boldStyle = css`
  font-family: "KoPubWorldDotumBold";
`;

export const introText = (
  <>
    <b css={boldStyle}>마사</b>에 접속하신 것을 환영합니다. 무사히 잠드셨군요?
    마사는 국가 공인기관에서 만든 해몽 신뢰도 97.8%의 직업 적성 컨설턴트
    시스템입니다. 검사 시간은 최대 2분이 소요됩니다.
    <br />
    <br />
    <b css={headerStyle}>검사 진행하기</b>
    <br />
    1. 직업 선택 페이지에서 취업을 희망하는 직업을 선택하세요. <br />
    2. <b css={boldStyle}>마사 </b>적성검사에서는 최신 기술의 집약체인{" "}
    <b css={boldStyle}>드림클리너</b>를 사용합니다. <br />
    3. 드림 클리너는 당신 내부에 잠재된 <b css={boldStyle}>적성파형</b>
    을 탐지합니다. 손잡이를 잡고 바닥을 스캔하세요. <br />
    4. 종종 본인이 선택한 직업과 적합도가 높은 경우 미묘하게 다른 베타파형이
    끼어들 수 있습니다. 그렇다면{" "}
    <b css={boldStyle}>베타파형과 결합을 시도해보세요!</b> 결합은 베타파형을
    10초간 쬐면 이루어집니다. (tip: 베타파형과 결합한 사람들의 97.8%는 취업에
    성공했습니다!) <br />
    <br />
    <b css={headerStyle}>결과 확인하기</b>
    <br />
    1. 2분이 지나면 <b css={boldStyle}>마사</b>가 수집한 당신의 적성 파형을
    분석합니다. 분석이 진행되는 동안 장치를 벗고 대기해주세요. <br />
    2. 핸드폰 화면에 뜬 당신의 검사 결과를 확인한 후{" "}
    <b css={boldStyle}>프린트</b>
    버튼을 누르세요. <br />
    3. <b css={boldStyle}>검사실 </b>밖 직원에게 핸드폰을 제출하고 인쇄 된
    결과지를 수령하세요. <br />
    4. 이제 꿈에서 깨어나셔도 됩니다. <br />
    <br />
    수령하신 결과지는 회사를 지원하실 때 이력서와 함께 제출하시면 됩니다.
  </>
);

export const aboutText = `마리아 불러 어머님,
          별을 있습니다. 별 가을 책상을 나는 잠, 별 듯합니다. 슬퍼하는 너무나
          위에 별을 프랑시스 당신은 다 거외다. 이런 별 어머니, 이름을 것은
          봅니다. 이름과, 패, 헤일 시와 그리고 한 쉬이 봅니다. 계집애들의 둘
          애기 가을로 멀리 토끼, 지나가는 밤이 까닭입니다. 하나에 계절이 그러나
          릴케 무성할 계집애들의 언덕 봅니다. 이름을 책상을 이 위에도 그러나
          헤는 까닭입니다. 책상을 잠, 아스라히 하나에 이름을 봅니다. 이웃 자랑처럼 둘 써 위에도 봅니다. 하나에 아스라히 위에 멀리 했던 별
          봅니다. 가득 나는 노루, 한 무성할 어머님, 까닭입니다. 이름을 내일
          토끼, 이름과, 거외다. 계집애들의 내 파란 어머니, 이름을 별 내린
          까닭입니다. 이름과, 별 헤일 걱정도 라이너 봅니다. 무엇인지 없이 한
          이네들은 별빛이 나는 잔디가 사람들의 멀리 계십니다. 때 위에 어머님,
          하나에 걱정도 다하지 소녀들의 새겨지는 거외다. 당신은 써 새겨지는
          이름자를 봅니다. 아직 이네들은 이국 어머니, 남은 하나에 듯합니다.
          이름과, 이국 자랑처럼 가난한 잔디가 봅니다. 밤을 차 릴케 시인의 내 별
          많은 때 어머니 봅니다. 책상을 어머님, 하나에 거외다. 소학교 하나에
          멀리 사람들의 흙으로 계십니다. 소녀들의 잔디가 다하지 그리고 듯합니다.
          위에 계절이 이름과, 별을 까닭입니다. 경, 소학교 했던 흙으로 옥
          하늘에는 그리워 봅니다. 별 겨울이 북간도에 헤일 하늘에는 슬퍼하는
          거외다. 멀리 부끄러운 보고, 이름을 슬퍼하는 북간도에 헤는 벌써 봅니다.
          동경과 책상을 나는 묻힌 프랑시스 이름과 추억과 오는 별을 거외다. 별
          속의 아스라히 새겨지는 당신은 봅니다. 언덕 남은 책상을 있습니다.
          어머님, 말 하늘에는 겨울이 나는 별빛이 듯합니다.`;

export type JobType = "COSMIC" | "HUMAN" | "FUTURE";

export type JobInfo = {
  jobId: number;
  jobName: string;
  jobType: JobType;
  // generatedImageNames?: string[];
};

export const jobNameList = [
  "과몰입 방지 칼럼니스트",
  "뇌활성화 조립가",
  "다중우주 지도 기록자",
  "디지털 사후세계 장의사",
  "리얼리티 쇼 예측 점성술사",
  "마이크로 주택 건축가",
  "메타휴먼 메이크업 아티스트",
  "미래음악 평론가",
  "베테랑 베타 테스터",
  "소셜미디어 디톡스 전문가",
  "시공간 균열 설계자",
  "심사숙고 전문가",
  "암흑물질 청소부",
  "우주 엘리베이터 안내원",
  "웹 조향사",
  "이모지 번역가",
  "인공 장기 디자이너",
  "자연생물 근본주의 요리사",
  "종교전쟁 해결 위원",
  "중력 시공 컨설턴트",
  "추상전략 시뮬레이터 이용자",
  "퀀텀 현실 치료사",
  "크립토 생명체 사파리 가이드",
  "키링 지휘자",
  "태양풍 탐험가",
  "팬덤 커뮤니케이터",
  "D41 주사위 공예가",
  "창조주 지망생",
  "은하계 기상 캐스터",
  "우주 항해 측량사",
];

export const haemongingText = [
  "빠른 로딩 확률을 얻기위해 주사위를 굴리는 중…",
  "미래음악 평론가의 별점 확인 중…",
  "속도가 가장 빠른 다중우주를 찾는 중….",
  "균열이 난 시공간 속으로 빨려 들어가는 중…",
  "비행하기 좋은 태양풍을 찾는 중…",
  "우주 엘리베이터의 목적지 설정 중…",
  "우주 엘리베이터의 속도를 5cm 상향 중…",
  "고장난 암흑물질 알고리즘 수정 중…",
  "마이크로 주택 입주 조건을 확인 중…",
  "속이 뻔한 속임수를 제거하는 중….",
  "창조주 데이터베이스를 리셋 하는 중…",
  "중력 시공 리스트를 선별하는 중…",
  "키링 지휘자의 공연을 감상하는 중…",
  "해몽을 위한 뉴런 다듬는 중…",
  "과몰입 방지를 위한 규칙 설정 중…",
  "해몽에 불필요한 다중우주를 제거하는 중…",
  "해몽에 필요한 다중우주를 개발 중…",
  "이모지 번역률 개선 중…",
  "빠른 로딩을 위해 심사숙고 중…",
  "구부린 시공간을 맞닿게 하는 중…",
  "새로운 향기 출시 이벤트에 참여 중…",
  "근본 자연생물을 채집하는 중…",
  "인공 장기의 동력을 주입하는 중…",
  "사용자의 리얼리티 쇼 장악력을 예측 중…",
  "적합한 잠자리 방향을 위해 베타 테스트 중…",
  "알맞은 연봉을 위한 협상 테이블 마련 중…",
  "레시피에 암흑물질 2스푼 추가 중…",
  "해몽의 메인 테마를 선별하는 중…",
  "해몽의 군더더기를 도려내는 중…",
  "해몽에 어울리는 점심특선을 선정하는 중…",
  "3보다 빠른 1을 투입하는 중…",
  "중력을 뒤집어 관점을 바꿔보는 중…",
  "거대한 팬덤의 의견을 수렴하는 중…",
  "해몽에 알맞은 날씨는 추전받는 중…",
  "해몽 성분표 표기에 열을 올리는 중…",
  "해몽을 위한 x,y,z, 좌표 재설정 중…",
  "해몽 내부 중력을 위한 전화상담 중…",
  "크리스토퍼도 놀란 해몽 중…",
  "해몽이 너에게로 달려가는 중…슝…",
  "해몽이 해롱해롱거리는 중…",
  "슈퍼컴퓨터가…온 우주를….으아악…",
  "해몽…진행…웅앵웅….",
  "중요한건 꺾이지 않는 중…",
  "해몽 씨몬…",
  "해몽은 나야 둘이 될 수 없어…",
  "펄스의 팔씨의 르씨가 코쿤에서 퍼지하는 해몽 중…",
  "이번 주 1등 당첨 로또번호 생성 중… (아님)",
  "실존주의에서 빠져 나오는 중…",
  "시간과 사유가 해몽 직조하는 중…",
  "쉿🤫~해몽중😘",
];

export const generateRandomIndex = () => {
  const randomFloat = Math.random();

  const min = 0;
  const max = 49;
  const randomInt = Math.floor(randomFloat * (max - min + 1)) + min;

  return randomInt;
};

export type NavigationType =
  | "main"
  | "about"
  | "playintro"
  | "jobselect"
  | "createmap"
  | "playing"
  | "result";

export const PREV_NAV_PATH: { [key in NavigationType]: string | null } = {
  main: null,
  about: "/",
  playintro: "/",
  jobselect: "/playintro",
  createmap: "/jobselect",
  playing: "/createmap",
  result: "/playing",
};

export const NEXT_NAV_PATH: { [key in NavigationType]: string | null } = {
  main: "/playintro",
  about: null,
  playintro: "/jobselect",
  jobselect: "/createmap",
  createmap: "/playing",
  playing: "/result",
  result: null,
};
