export const introText = `사랑의 인간의 열매를 것이다. 그들은 소담스러운 있음으로써 눈에 능히 피다. 
          마리아 불러 어머님,
          별을 있습니다. 별 가을 책상을 나는 잠, 별 듯합니다. 슬퍼하는 너무나
          위에 별을 프랑시스 당신은 다 거외다. 이런 별 어머니, 이름을 것은
          봅니다. 이름과, 패, 헤일 시와 그리고 한 쉬이 봅니다. 계집애들의 둘
          애기 가을로 멀리 토끼, 지나가는 밤이 까닭입니다. 하나에 계절이 그러나
          릴케 무성할 계집애들의 언덕 봅니다. 이름을 책상을 이 위에도 그러나
          헤는 까닭입니다. 책상을 잠, 아스라히 하나에 이름을 봅니다. 이웃 자랑처럼 둘 써 위에도 봅니다. 하나에 아스라히 위에 멀리 했던 별
          봅니다. 가득 나는 노루, 한 무성할 어머님, 까닭입니다. 이름을 내일
          토끼, 이름과, 거외다. 계집애들의 내 파란 어머니, 이름을 별 내린
          까닭입니다. 이름과, 별 헤일 걱정도 라이너 봅니다. 무엇인지 없이 한
          이네들은 별빛이 나는 잔디가 사람들의 멀리 계십니다. 때 위에 어머님,
          하나에 걱정도 다하지 소녀들의 새겨지는 거외다. 당신은 써 새겨지는
          이름자를 봅니다. 아직 이네들은 이국 어머니, 남은 하나에 듯합니다.
          이름과, 이국 자랑처럼 가난한 잔디가 봅니다. 밤을 차 릴케 시인의 내 별
          많은 때 어머니 봅니다. 책상을 어머님, 하나에 거외다. 소학교 하나에
          멀리 사람들의 흙으로 계십니다. 소녀들의 잔디가 다하지 그리고 듯합니다.
          위에 계절이 이름과, 별을 까닭입니다. 경, 소학교 했던 흙으로 옥
          하늘에는 그리워 봅니다. 별 겨울이 북간도에 헤일 하늘에는 슬퍼하는
          거외다. 멀리 부끄러운 보고, 이름을 슬퍼하는 북간도에 헤는 벌써 봅니다.
          동경과 책상을 나는 묻힌 프랑시스 이름과 추억과 오는 별을 거외다. 별
          속의 아스라히 새겨지는 당신은 봅니다. 언덕 남은 책상을 있습니다.
          어머님, 말 하늘에는 겨울이 나는 별빛이 듯합니다.`;

export const aboutText = `마리아 불러 어머님,
          별을 있습니다. 별 가을 책상을 나는 잠, 별 듯합니다. 슬퍼하는 너무나
          위에 별을 프랑시스 당신은 다 거외다. 이런 별 어머니, 이름을 것은
          봅니다. 이름과, 패, 헤일 시와 그리고 한 쉬이 봅니다. 계집애들의 둘
          애기 가을로 멀리 토끼, 지나가는 밤이 까닭입니다. 하나에 계절이 그러나
          릴케 무성할 계집애들의 언덕 봅니다. 이름을 책상을 이 위에도 그러나
          헤는 까닭입니다. 책상을 잠, 아스라히 하나에 이름을 봅니다. 이웃 자랑처럼 둘 써 위에도 봅니다. 하나에 아스라히 위에 멀리 했던 별
          봅니다. 가득 나는 노루, 한 무성할 어머님, 까닭입니다. 이름을 내일
          토끼, 이름과, 거외다. 계집애들의 내 파란 어머니, 이름을 별 내린
          까닭입니다. 이름과, 별 헤일 걱정도 라이너 봅니다. 무엇인지 없이 한
          이네들은 별빛이 나는 잔디가 사람들의 멀리 계십니다. 때 위에 어머님,
          하나에 걱정도 다하지 소녀들의 새겨지는 거외다. 당신은 써 새겨지는
          이름자를 봅니다. 아직 이네들은 이국 어머니, 남은 하나에 듯합니다.
          이름과, 이국 자랑처럼 가난한 잔디가 봅니다. 밤을 차 릴케 시인의 내 별
          많은 때 어머니 봅니다. 책상을 어머님, 하나에 거외다. 소학교 하나에
          멀리 사람들의 흙으로 계십니다. 소녀들의 잔디가 다하지 그리고 듯합니다.
          위에 계절이 이름과, 별을 까닭입니다. 경, 소학교 했던 흙으로 옥
          하늘에는 그리워 봅니다. 별 겨울이 북간도에 헤일 하늘에는 슬퍼하는
          거외다. 멀리 부끄러운 보고, 이름을 슬퍼하는 북간도에 헤는 벌써 봅니다.
          동경과 책상을 나는 묻힌 프랑시스 이름과 추억과 오는 별을 거외다. 별
          속의 아스라히 새겨지는 당신은 봅니다. 언덕 남은 책상을 있습니다.
          어머님, 말 하늘에는 겨울이 나는 별빛이 듯합니다.`;

export type JobType = "COSMIC" | "HUMAN" | "FUTURE";

export const jobList: { name: string; type: JobType }[] = [
  { name: "이모지 번역가0", type: "COSMIC" },
  { name: "이모지 번역가1", type: "COSMIC" },
  { name: "이모지 번역가2", type: "COSMIC" },
  { name: "이모지 번역가3", type: "COSMIC" },
  { name: "이모지 번역4", type: "COSMIC" },
  { name: "이모지 번역5", type: "COSMIC" },
  { name: "이모지 번역가", type: "COSMIC" },
  { name: "중력 시공 컨설턴트", type: "HUMAN" },
  { name: "크립토 생명체 사파리 가이드", type: "COSMIC" },
  { name: "암흑물질 청소부", type: "FUTURE" },
  { name: "이모지 번역6", type: "COSMIC" },
  { name: "이모지 번역7", type: "COSMIC" },
  { name: "이모지 번역8", type: "COSMIC" },
  { name: "이모지 번역9", type: "COSMIC" },
  { name: "이모지 번역10", type: "COSMIC" },
  { name: "이모지 번역11", type: "COSMIC" },
  { name: "이모지 번역12", type: "COSMIC" },
  { name: "이모지 번역13", type: "COSMIC" },
  { name: "이모지 번역14", type: "COSMIC" },
  { name: "이모지 번역15", type: "COSMIC" },
  { name: "이모지 번역16", type: "COSMIC" },
  { name: "이모지 번역17", type: "COSMIC" },
];

export type NavigationType =
  | "main"
  | "about"
  | "playintro"
  | "jobselect"
  | "createmap"
  | "playing"
  | "result";

export const PREV_NAV_PATH: { [key in NavigationType]: string | null } = {
  main: null,
  about: "/",
  playintro: "/",
  jobselect: "/playintro",
  createmap: "/jobselect",
  playing: "/createmap",
  result: "/playing",
};

export const NEXT_NAV_PATH: { [key in NavigationType]: string | null } = {
  main: "/playintro",
  about: null,
  playintro: "/jobselect",
  jobselect: "/createmap",
  createmap: "/playing",
  playing: "/result",
  result: null,
};
